public class Main {
    public static void main(String[] args) {
        int ticket = 5000;// Объявляете переменные для входных данных и
        int x = ticket / 20;// параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили


        int y = x;// Рассчитываете количество бонусных миль, используя
        System.out.println(" Количество бонусных миль: " + (y));// значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}